bench/results/rust-axum/v3-20260523-113347-rust-axum/read-c200.txt
Running 30s test @ http://localhost:3001
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.04ms    1.53ms  40.01ms   71.13%
    Req/Sec     3.12k   485.53    13.66k    76.52%
  746700 requests in 30.10s, 100.41MB read
  Non-2xx or 3xx responses: 746700
Requests/sec:  24805.35
Transfer/sec:      3.34MB